backend/app/controllers/dislikes_controller.rb

	def index
		user_id = params[:user_id]
		spotify_id = params[:spotify_id]
		artist = Artist.find_by spotify_id: spotify_id
			if !artist
				artist = Artist.create(spotify_id: spotify_id)
			end
		artist_id = artist.id
			dislike = Dislike.create(artist_id: artist_id, user_id: user_id)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."spotify_id" = $1 LIMIT 1  [["spotify_id", "3nFkdlSjzX9mRTtwJOzDYB"]]
INSERT INTO "artists" ("spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["spotify_id", "3nFkdlSjzX9mRTtwJOzDYB"], ["created_at", "2015-10-29 23:14:46.960027"], ["updated_at", "2015-10-29 23:14:46.960027"]]
INSERT INTO "dislikes" ("artist_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 25], ["user_id", 8], ["created_at", "2015-10-29 23:14:46.968812"], ["updated_at", "2015-10-29 23:14:46.968812"]]