backend/app/controllers/likes_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."spotify_id" = $1 LIMIT 1  [["spotify_id", "6Bygk8YvDJTfJSuY5ccUJH"]]
INSERT INTO "artists" ("spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["spotify_id", "6Bygk8YvDJTfJSuY5ccUJH"], ["created_at", "2015-10-27 16:24:12.376102"], ["updated_at", "2015-10-27 16:24:12.376102"]]
INSERT INTO "likes" ("artist_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 1], ["user_id", 5], ["created_at", "2015-10-27 16:30:33.062680"], ["updated_at", "2015-10-27 16:30:33.062680"]]
---
	def index
		user_id = params[:user_id]
		spotify_id = params[:spotify_id] #6Bygk8YvDJTfJSuY5ccUJH
		artist = Artist.find_by spotify_id: spotify_id
			if !artist
				artist = Artist.create(spotify_id: spotify_id)
			end
		artist_id = artist.id
				like = Like.create(artist_id: artist_id, user_id: user_id)

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 8]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 4]]
---
	def oki
		user_id = params[:user_id]
		@like = Like.where(user_id: user_id).all
		@like_data = []
		@like.each do |like|
			artist_i = Artist.find(like.artist_id)