backend/app/controllers/users_controller.rb

  def index
  	@user_id = session[:user_id]
  	@user = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def create
		user = User.new(user_params)

		if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"